{"packages":[{"name":"json-helper-tools","description":"A collection of utilities to check if a string contains JSON that can be used in JSON.parse() and removes any text before or after.","functions":[{"function_name":"isJSON","function_summary":"Checks if a string is a valid JSON. This function takes a string as input and returns true if the string is a valid JSON, otherwise, it returns false. For example, it would return true for '{\"key\": \"value\"}', but false for 'This is not JSON'. It does not handle extreme cases like deeply nested JSON objects or very long strings."},{"function_name":"getJsonStartIndex","function_summary":"Finds the index of the first character of valid JSON in a string. This function takes a string as input and returns the index of the first character of a valid JSON object or array in the input string. It ignores any text before the start of valid JSON. For example, it would return 5 for 'Hello{\"key\":\"value\"}'. If no valid JSON is found, it returns -1."},{"function_name":"getJsonEndIndex","function_summary":"Finds the index of the last character of valid JSON in a string. This function takes a string as input and returns the index of the last character of a valid JSON object or array in the input string. It ignores any text after the end of valid JSON. For example, it would return 17 for '{\"key\":\"value\"}Bye'. If no valid JSON is found, it returns -1."},{"function_name":"extractJSON","function_summary":"Extracts the valid JSON from a string, if present. This function takes a string as input and returns the valid JSON substring. It removes any text before or after the JSON. For example, it would return '{\"key\":\"value\"}' for 'Hello{\"key\":\"value\"}Bye'. If no valid JSON is found, it returns an empty string."},{"function_name":"replaceTextBeforeJson","function_summary":"Replaces any text before valid JSON with a specified string. This function takes two arguments, the input string, and a replacement string. It replaces any text before the start of valid JSON with the replacement string. For example, it would return 'New Text{\"key\":\"value\"}' for input string 'Hello{\"key\":\"value\"}' and replacement string 'New Text'. If no valid JSON is found, it returns the original string."},{"function_name":"replaceTextAfterJson","function_summary":"Replaces any text after valid JSON with a specified string. This function takes two arguments, the input string, and a replacement string. It replaces any text after the end of valid JSON with the replacement string. For example, it would return '{\"key\":\"value\"}New Text' for input string '{\"key\":\"value\"}Bye' and replacement string 'New Text'. If no valid JSON is found, it returns the original string."},{"function_name":"trimTextAroundJson","function_summary":"Trims blank spaces or any specified string around valid JSON. This function takes two arguments, the input string, and an optional trim string. It removes any blank spaces or the specified trim string around the valid JSON. For example, it would return '{\"key\":\"value\"}' for input string '   {\"key\":\"value\"}   '. If no valid JSON is found, it returns the original string."},{"function_name":"removeNonJsonKeys","function_summary":"Removes any keys and their values from a JSON object if they are not valid JSON. This function takes a JSON object as input and returns a new JSON object with any invalid JSON keys removed. It handles nested JSON objects as well. For example, it would return '{\"key1\": \"value\"}' for input '{\"key1\": \"value\", \"key2\": \"This is not JSON\"}'."},{"function_name":"jsonStringToObject","function_summary":"Parses a valid JSON string into a JavaScript object. This function takes a valid JSON string as input and returns a JavaScript object representation of the input string. It throws an error if the input string is not valid JSON. For example, it would return '{key: \"value\"}' for input '{\"key\":\"value\"}'."},{"function_name":"objectToJsonString","function_summary":"Serializes a JavaScript object into a JSON string. This function takes a JavaScript object as input and returns a JSON string representation of the input object. It throws an error if the input is not a valid JSON object. For example, it would return '{\"key\":\"value\"}' for input '{key: \"value\"}'."}]}]}